class AppWeekStrings {
  static const strings = [
    "Ваша удача в управлении финансами улучшается! За эту неделю вы потратили на развлечения на 20% меньше, чем на прошлой неделе.",
    "Отличная работа! Ваше увеличение сбережений за последние две недели составило 15%.",
    "Помните, что каждая экономия приносит результаты! На этой неделе вы сократили расходы на транспорт на 10%.",
    "Финансовая ответственность приносит свои плоды! На этой неделе вы увеличили сумму, отложенную на чрезвычайный случай, на 25%.",
    "Вы продолжаете двигаться вперед! Ваши траты на рестораны снизились на 15% за прошлую неделю.",
    "Замечательно! Ваши еженедельные траты на одежду уменьшились на 10% по сравнению с предыдущей неделей.",
    "Не забывайте о целях! За последнюю неделю вы сократили траты на ненужные покупки на 30%.",
    "Поздравляем с вашими усилиями по экономии! Ваши расходы на развлечения уменьшились на 20% за этот квартал.",
    "Ваши усилия по сэкономленю начинают приносить плоды! За эту неделю вы потратили на кафе на 15% меньше, чем обычно.",
    "Ваша финансовая дисциплина впечатляет! За последнюю неделю вы сократили расходы на технику и электронику на 10%.",
    "Замечательно проделанная работа! В этом квартале вы снизили расходы на коммунальные услуги на 15%.",
    "Каждый небольшой шаг в сторону экономии приближает вас к вашим целям! Траты на кофе уменьшились на 10% за последние две недели.",
    "Ваше умение контролировать расходы впечатляет! За эту неделю вы сократили траты на транспорт на 15%.",
    "Продолжайте в том же духе! Ваши расходы на развлечения снизились на 10% за последнюю неделю.",
    "Ваши усилия по сбережению приносят результаты! В этом квартале вы увеличили сумму, отложенную на путешествия, на 20%."
  ];
}

class AppMonthStrings {
  static const strings = [
    "Ваша удача в управлении финансами улучшается! За этот месяц вы потратили на развлечения на 20% меньше, чем в прошлом месяце.",
    "Отличная работа! Ваше увеличение сбережений за последние два месяца составило 15%.",
    "Помните, что каждая экономия приносит результаты! На этой неделе вы сократили расходы на транспорт на 10%.",
    "Финансовая ответственность приносит свои плоды! В этом месяце вы увеличили сумму, отложенную на чрезвычайный случай, на 25%.",
    "Вы продолжаете двигаться вперед! Ваши траты на рестораны снизились на 15% за прошлую неделю.",
    "Замечательно! Ваши ежемесячные траты на одежду уменьшились на 10% по сравнению с предыдущим месяцем.",
    "Не забывайте о целях! За последний месяц вы сократили траты на ненужные покупки на 30%.",
    "Поздравляем с вашими усилиями по экономии! Ваши расходы на развлечения уменьшились на 20% за этот квартал.",
    "Ваши усилия по сэкономленю начинают приносить плоды! За эту неделю вы потратили на кафе на 15% меньше, чем обычно.",
    "Ваша финансовая дисциплина впечатляет! За последний месяц вы сократили расходы на технику и электронику на 10%.",
    "Замечательно проделанная работа! В этом квартале вы снизили расходы на коммунальные услуги на 15%.",
    "Помните, что каждый небольшой шаг в сторону экономии приближает вас к вашим целям! Ваши траты на покупку кофе на вынос уменьшились на 10% за последние две недели.",
    "Ваше умение контролировать расходы впечатляет! За этот месяц вы сократили траты на транспорт на 15%.",
    "Продолжайте в том же духе! Ваши расходы на развлечения снизились на 10% за последний месяц.",
    "Ваши усилия по сбережению приносят результаты! В этом квартале вы увеличили сумму, отложенную на путешествия, на 20%."
  ];
}


class AppYearStrings {
  static const strings = [
    "Ваша удача в управлении финансами улучшается! За этот месяц вы потратили на развлечения на 20% меньше, чем в прошлом месяце.",
    "Отличная работа! Ваше увеличение сбережений за последние два месяца составило 15%.",
    "Помните, что каждая экономия приносит результаты! На этой неделе вы сократили расходы на транспорт на 10%.",
    "Финансовая ответственность приносит свои плоды! В этом месяце вы увеличили сумму, отложенную на чрезвычайный случай, на 25%.",
    "Вы продолжаете двигаться вперед! Ваши траты на рестораны снизились на 15% за прошлую неделю.",
    "Замечательно! Ваши ежемесячные траты на одежду уменьшились на 10% по сравнению с предыдущим месяцем.",
    "Не забывайте о целях! За последний месяц вы сократили траты на ненужные покупки на 30%.",
    "Поздравляем с вашими усилиями по экономии! Ваши расходы на развлечения уменьшились на 20% за этот квартал.",
    "Ваши усилия по сэкономленю начинают приносить плоды! За эту неделю вы потратили на кафе на 15% меньше, чем обычно.",
    "Ваша финансовая дисциплина впечатляет! За последний месяц вы сократили расходы на технику и электронику на 10%.",
    "Замечательно проделанная работа! В этом квартале вы снизили расходы на коммунальные услуги на 15%.",
    "Помните, что каждый небольшой шаг в сторону экономии приближает вас к вашим целям! Ваши траты на покупку кофе на вынос уменьшились на 10% за последние две недели.",
    "Ваше умение контролировать расходы впечатляет! За этот месяц вы сократили траты на транспорт на 15%.",
    "Продолжайте в том же духе! Ваши расходы на развлечения снизились на 10% за последний месяц.",
    "Ваши усилия по сбережению приносят результаты! В этом квартале вы увеличили сумму, отложенную на путешествия, на 20%."
  ];
}
